Revit 2026 API

# StructuralConnectionHandlerAddReferences Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddReferences(
	Document document,
	IList<Reference> picks
)
```
```vb
Public Sub AddReferences (
	document As Document,
	picks As IList(Of Reference)
)
```
```cpp
public:
void AddReferences(
	Document^ document,
	IList<Reference^>^ picks
)
```
```fsharp
member AddReferences :
        document : Document *
        picks : IList<Reference> -> unit
```

#### Parameters

document Document

picks IListReference

#### Reference

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace